# Table of Contents
 <p><div class="lev1 toc-item"><a href="#Connect-the-sql" data-toc-modified-id="Connect-the-sql-1"><span class="toc-item-num">1&nbsp;&nbsp;</span>Connect the sql</a></div><div class="lev1 toc-item"><a href="#Know-your-database" data-toc-modified-id="Know-your-database-2"><span class="toc-item-num">2&nbsp;&nbsp;</span>Know your database</a></div><div class="lev1 toc-item"><a href="#Read-dat-files-of-database" data-toc-modified-id="Read-dat-files-of-database-3"><span class="toc-item-num">3&nbsp;&nbsp;</span>Read dat files of database</a></div><div class="lev1 toc-item"><a href="#Section-2" data-toc-modified-id="Section-2-4"><span class="toc-item-num">4&nbsp;&nbsp;</span>Section 2</a></div><div class="lev2 toc-item"><a href="#challange-1" data-toc-modified-id="challange-1-41"><span class="toc-item-num">4.1&nbsp;&nbsp;</span>challange 1</a></div>

# Connect the sql

In [1]:
import numpy as np
import pandas as pd
import os
import yaml

with open( os.path.expanduser('~') + "/.postgres_conf.yml", 'r') as stream:
    try:
        yaml_dict = yaml.safe_load(stream)
    except yaml.YAMLError as exc:
        print(exc)

pw = yaml_dict['password']

In [2]:
%load_ext sql

In [3]:
%sql postgres://postgres:$pw@localhost:5432/dvdrental

'Connected: postgres@dvdrental'

# Know your database

In [4]:
%%sql
SELECT TABLE_NAME
FROM INFORMATION_SCHEMA.TABLES
WHERE TABLE_TYPE = 'BASE TABLE'
AND TABLE_CATALOG='dvdrental'
and TABLE_NAME  not like 'pg_%'
and TABLE_NAME  not like 'sql_%'
-- order by table_name

 * postgres://postgres:***@localhost:5432/dvdrental
15 rows affected.

[('staff',),
 ('category',),
 ('film_category',),
 ('country',),
 ('actor',),
 ('language',),
 ('inventory',),
 ('payment',),
 ('rental',),
 ('city',),
 ('store',),
 ('film',),
 ('address',),
 ('film_actor',),
 ('customer',)]

In [5]:
%%sql
select column_name, data_type, character_maximum_length
    from INFORMATION_SCHEMA.COLUMNS 
    where table_name = 'customer';

 * postgres://postgres:***@localhost:5432/dvdrental
10 rows affected.

[('customer_id', 'integer', None),
 ('store_id', 'smallint', None),
 ('first_name', 'character varying', 45),
 ('last_name', 'character varying', 45),
 ('email', 'character varying', 50),
 ('address_id', 'smallint', None),
 ('activebool', 'boolean', None),
 ('create_date', 'date', None),
 ('last_update', 'timestamp without time zone', None),
 ('active', 'integer', None)]

In [6]:
%%sql
select * from country limit 2;

 * postgres://postgres:***@localhost:5432/dvdrental
2 rows affected.

[(1, 'Afghanistan', datetime.datetime(2006, 2, 15, 9, 44)),
 (2, 'Algeria', datetime.datetime(2006, 2, 15, 9, 44))]

In [7]:
%%sql
select * from actor limit 2;

 * postgres://postgres:***@localhost:5432/dvdrental
2 rows affected.

[(1, 'Penelope', 'Guiness', datetime.datetime(2013, 5, 26, 14, 47, 57, 620000)),
 (2, 'Nick', 'Wahlberg', datetime.datetime(2013, 5, 26, 14, 47, 57, 620000))]

In [8]:
%%sql
select * from film limit 2;

 * postgres://postgres:***@localhost:5432/dvdrental
2 rows affected.

[(133, 'Chamber Italian', 'A Fateful Reflection of a Moose And a Husband who must Overcome a Monkey in Nigeria', 2006, 1, 7, Decimal('4.99'), 117, Decimal('14.99'), 'NC-17', datetime.datetime(2013, 5, 26, 14, 50, 58, 951000), ['Trailers'], "'chamber':1 'fate':4 'husband':11 'italian':2 'monkey':16 'moos':8 'must':13 'nigeria':18 'overcom':14 'reflect':5"),
 (384, 'Grosse Wonderful', 'A Epic Drama of a Cat And a Explorer who must Redeem a Moose in Australia', 2006, 1, 5, Decimal('4.99'), 49, Decimal('19.99'), 'R', datetime.datetime(2013, 5, 26, 14, 50, 58, 951000), ['Behind the Scenes'], "'australia':18 'cat':8 'drama':5 'epic':4 'explor':11 'gross':1 'moos':16 'must':13 'redeem':14 'wonder':2")]

# Read dat files of database

In [9]:
!ls ../data/dvdrental/

2163.dat    2168.dat    2173.dat    2179.dat    2185.dat    restore.sql
2165.dat    2169.dat    2175.dat    2181.dat    2187.dat    toc.dat
2167.dat    2171.dat    2177.dat    2183.dat    2189.dat

In [10]:
!head ../data/dvdrental/2163.dat

1	Penelope	Guiness	2013-05-26 14:47:57.62
2	Nick	Wahlberg	2013-05-26 14:47:57.62
3	Ed	Chase	2013-05-26 14:47:57.62
4	Jennifer	Davis	2013-05-26 14:47:57.62
5	Johnny	Lollobrigida	2013-05-26 14:47:57.62
6	Bette	Nicholson	2013-05-26 14:47:57.62
7	Grace	Mostel	2013-05-26 14:47:57.62
8	Matthew	Johansson	2013-05-26 14:47:57.62
9	Joe	Swank	2013-05-26 14:47:57.62
10	Christian	Gable	2013-05-26 14:47:57.62

In [11]:
%%bash

for f in `ls ../data/dvdrental/[^toc]*.dat`                                                                
   do
      echo
      echo  "File: $f"; 
      echo "==================================================================="
      head -2  "$f";
done;

File: ../data/dvdrental/2163.dat
===================================================================
1	Penelope	Guiness	2013-05-26 14:47:57.62
2	Nick	Wahlberg	2013-05-26 14:47:57.62

File: ../data/dvdrental/2165.dat
===================================================================
1	Action	2006-02-15 09:46:27
2	Animation	2006-02-15 09:46:27

File: ../data/dvdrental/2167.dat
===================================================================
133	Chamber Italian	A Fateful Reflection of a Moose And a Husband who must Overcome a Monkey in Nigeria	2006	1	7	4.99	117	14.99	NC-17	2013-05-26 14:50:58.951	{Trailers}	'chamber':1 'fate':4 'husband':11 'italian':2 'monkey':16 'moos':8 'must':13 'nigeria':18 'overcom':14 'reflect':5
384	Grosse Wonderful	A Epic Drama of a Cat And a Explorer who must Redeem a Moose in Australia	2006	1	5	4.99	49	19.99	R	2013-05-26 14:50:58.951	{"Behind the Scenes"}	'australia':18 'cat':8 'drama':5 'epic':4 'explor':11 'gross':1 'moos':16 'must':13 'redeem':14 'wonder':2

File: ../data/dvdrental/2168.dat
===================================================================
1	1	2006-02-15 10:05:03
1	23	2006-02-15 10:05:03

File: ../data/dvdrental/2169.dat
===================================================================
1	6	2006-02-15 10:07:09
2	11	2006-02-15 10:07:09

File: ../data/dvdrental/2171.dat
===================================================================
1	47 MySakila Drive	\N	Alberta	300			2006-02-15 09:45:30
2	28 MySQL Boulevard	\N	QLD	576			2006-02-15 09:45:30

File: ../data/dvdrental/2173.dat
===================================================================
1	A Corua (La Corua)	87	2006-02-15 09:45:25
2	Abha	82	2006-02-15 09:45:25

File: ../data/dvdrental/2175.dat
===================================================================
1	Afghanistan	2006-02-15 09:44:00
2	Algeria	2006-02-15 09:44:00

File: ../data/dvdrental/2177.dat
===================================================================
524	1	Jared	Ely	jared.ely@sakilacustomer.org	530	t	2006-02-14	2013-05-26 14:49:45.738	1
1	1	Mary	Smith	mary.smith@sakilacustomer.org	5	t	2006-02-14	2013-05-26 14:49:45.738	1

File: ../data/dvdrental/2179.dat
===================================================================
1	1	1	2006-02-15 10:09:17
2	1	1	2006-02-15 10:09:17

File: ../data/dvdrental/2181.dat
===================================================================
1	English             	2006-02-15 10:02:19
2	Italian             	2006-02-15 10:02:19

File: ../data/dvdrental/2183.dat
===================================================================
17503	341	2	1520	7.99	2007-02-15 22:25:46.996577
17504	341	1	1778	1.99	2007-02-16 17:23:14.996577

File: ../data/dvdrental/2185.dat
===================================================================
2	2005-05-24 22:54:33	1525	459	2005-05-28 19:40:33	1	2006-02-16 02:30:53
3	2005-05-24 23:03:39	1711	408	2005-06-01 22:12:39	1	2006-02-16 02:30:53

File: ../data/dvdrental/2187.dat
===================================================================
1	Mike	Hillyer	3	Mike.Hillyer@sakilastaff.com	1	t	Mike	8cb2237d0679ca88db6464eac60da96345513964	2006-05-16 16:13:11.79328	\\x89504e470d0a5a0a
2	Jon	Stephens	4	Jon.Stephens@sakilastaff.com	2	t	Jon	8cb2237d0679ca88db6464eac60da96345513964	2006-05-16 16:13:11.79328	\N

File: ../data/dvdrental/2189.dat
===================================================================
1	1	1	2006-02-15 09:57:12
2	2	2	2006-02-15 09:57:12

Manually compare and find the name of the datafile:
- 2163.dat actor
- 2167.dat  film
- 2179.dat film_category
-

# Section 2

## challange 1
How many payment transactions were greater than $5 ?

In [12]:
%%sql
select * from customer limit 5;

 * postgres://postgres:***@localhost:5432/dvdrental
5 rows affected.

[(524, 1, 'Jared', 'Ely', 'jared.ely@sakilacustomer.org', 530, True, datetime.date(2006, 2, 14), datetime.datetime(2013, 5, 26, 14, 49, 45, 738000), 1),
 (1, 1, 'Mary', 'Smith', 'mary.smith@sakilacustomer.org', 5, True, datetime.date(2006, 2, 14), datetime.datetime(2013, 5, 26, 14, 49, 45, 738000), 1),
 (2, 1, 'Patricia', 'Johnson', 'patricia.johnson@sakilacustomer.org', 6, True, datetime.date(2006, 2, 14), datetime.datetime(2013, 5, 26, 14, 49, 45, 738000), 1),
 (3, 1, 'Linda', 'Williams', 'linda.williams@sakilacustomer.org', 7, True, datetime.date(2006, 2, 14), datetime.datetime(2013, 5, 26, 14, 49, 45, 738000), 1),
 (4, 2, 'Barbara', 'Jones', 'barbara.jones@sakilacustomer.org', 8, True, datetime.date(2006, 2, 14), datetime.datetime(2013, 5, 26, 14, 49, 45, 738000), 1)]